{"status":"ok","totalResults":1324,"articles":[{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Obsessive, unyielding, a winner - Owen Farrell, England's World Cup talisman","description":"How a lifetime in elite sport has acclimatised England captain Owen Farrell to the pressure cooker atmosphere that awaits in a Rugby World Cup final.","url":"https://www.bbc.co.uk/sport/rugby-union/50261047","urlToImage":"https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/2FA6/production/_109489121_gettyimages-1184104460.jpg","publishedAt":"2019-11-01T11:59:12Z","content":"Owen Farrell leads out his team for the semi-final against New Zealand\r\n<table><tr><th>Rugby World Cup final: England v South Africa</th></tr>\r\n<tr><td>Venue: Yokohama International Stadium Date: Saturday, 2 November Kick-off: 09:00 GMT</td></tr><tr><td>Cover… [+8058 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"Joe Ritchie","title":"South Africa Crushes England in Rugby World Cup Final","description":"The Springboks won the country’s third world championship, 32-12, extending the dominance of teams from the Southern Hemisphere.","url":"https://www.nytimes.com/2019/11/02/sports/rugby/england-south-africa-rugby-world-cup.html","urlToImage":"https://static01.nyt.com/images/2019/11/02/world/02rugby4/02rugby4-facebookJumbo.jpg","publishedAt":"2019-11-02T10:56:05Z","content":"South Africa also won the title in 1995 and 2007; it is the only country to win every Rugby World Cup final it has contested.\r\nThe 1995 title, famously recounted in the film Invictus, was a turning point not only for South African rugby, but also for the coun… [+657 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Rugby World Cup: 'England could be at start of something great' - Matt Dawson column","description":"This is not just about England possibly becoming world champions, this could be the beginning of a legacy, writes World Cup winner Matt Dawson.","url":"https://www.bbc.co.uk/sport/rugby-union/50201040","urlToImage":"https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/ECEF/production/_108855606_matt_dawson_columnist.png","publishedAt":"2019-10-28T06:38:13Z","content":"<table><tr><th>Rugby World Cup final: England v South Africa</th></tr>\r\n<tr><td>Venue: Yokohama International Stadium Date: Saturday 2 November Kick-off: 09:00 GMT</td></tr><tr><td>Coverage: Live radio commentary on BBC Radio 5 Live and live text commentary o… [+5288 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Alan Dawson","title":"Former England rugby player James Haskell hits hard, likes his jiu-jitsu, and will be ready to fight MMA 'sooner rather than later,' according to his Bellator boss","description":"England's rugby team competes against South Africa in Saturday's Rugby World Cup final in Tokyo. The former England player James Haskell will likely be watching with interest in England, taking a break from one of his many jiu-jitsu classes. Haskell is one of…","url":"https://www.businessinsider.com/james-haskell-will-be-ready-to-fight-soon-2019-10","urlToImage":"https://image.businessinsider.com/5dbafdfbdee01969f6376782?width=1200&format=jpeg","publishedAt":"2019-10-31T16:31:51Z","content":"DUBLIN — When England's national rugby team treads onto the turf at the International Stadium Yokohama in Japan to compete against South Africa in the Rugby World Cup final on Saturday, one of its most reliable players of the last decade, James Haskell, will … [+5310 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Rugby World Cup Final preview - What you need to know for England vs South Africa","description":"Absolutely everything you need to know about the Rugby World Cup final in Yokohama this Saturday.","url":"https://www.espn.com/rugby/story/_/id/27963315/rugby-world-cup-final-2019-preview-need-know-england-vs-south-africa","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F1026%2Fr618442_1296x729_16%2D9.jpg","publishedAt":"2019-10-30T10:36:53Z","content":"TOKYO -- After two Rugby World Cup cycles of New Zealand dominance, rugby is ready for a fresh name to adorn the Webb Ellis Cup.\r\nSaturday's World Cup final in Yokohama will throw up a clash of hemispheres, styles and backstories as England face South Africa … [+38773 chars]"},{"source":{"id":"time","name":"Time"},"author":"Steve Douglas / AP","title":"South Africa Wins Third Rugby World Cup Title Over England","description":"A blowout victory in the Rugby World Cup final for the Springboks, yet another transcendent moment for post-apartheid South Africa.","url":"https://time.com/5716923/rugby-world-cup-winner-south-africa/","urlToImage":"https://timedotcom.files.wordpress.com/2019/11/south-africa-rugby-team.jpg?quality=85&w=1200&h=628&crop=1","publishedAt":"2019-11-02T18:50:03Z","content":"(YOKOHAMA, Japan) — Siya Kolisi grabbed the Webb Ellis Cup, gave it a kiss and hoisted it high as fireworks exploded and his teammates — black and white — rejoiced behind him.\r\nA blowout victory in the Rugby World Cup final for the Springboks.\r\nYet another tr… [+4895 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"'England produce finest performance of their lives to dethrone All Blacks'","description":"It was impossible to find an area in which England were not superior to the All Blacks, writes Tom Fordyce.","url":"https://www.bbc.co.uk/sport/rugby-union/50194297","urlToImage":"https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/693D/production/_109414962_hi057562886.jpg","publishedAt":"2019-10-26T14:00:45Z","content":"Media playback is not supported on this device\r\nWatch the best moments in England's win over All Blacks\r\nThis time, against New Zealand in a stone-cold World Cup classic, there was no need to go to boundaries scored.\r\nIf England have ever produced a better 80… [+5828 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"England's Rugby World Cup masterpiece rips the All Blacks apart","description":"It was always going to take something special to beat New Zealand at a World Cup for the first time in 12 years. Eddie Jones and his men delivered, and then some.","url":"https://www.espn.com/rugby/story/_/id/27931433/england-rugby-world-cup-masterpiece-rips-all-blacks-apart","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F1026%2Fr618439_1296x729_16%2D9.jpg","publishedAt":"2019-10-26T12:40:27Z","content":"YOKOHAMA -- This was as conclusive a win over the All Blacks as you will ever see.\r\nEngland shattered New Zealand's aura and prevented them from barely firing a shot. The eventual 19-7 scoreline flattered the All Blacks. England were better in every area of t… [+7572 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Sara M Moniuszko, USA TODAY","title":"Prince Harry to make first official visit to Japan for the 2019 Rugby World Cup Final","description":"Prince Harry is set to visit Japan Saturday for the 2019 Rugby World Cup Final between England and South Africa, his first official visit there.","url":"https://www.usatoday.com/story/entertainment/celebrities/2019/11/01/prince-harry-japan-visit-2019-rugby-world-cup-final/4121403002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/10/04/USAT/f4c149fc-3050-4213-af18-e5d6feba1a22-AFP_AFP_1KY7BQ.JPG?crop=3999,2249,x0,y203&width=3200&height=1680&fit=bounds","publishedAt":"2019-11-01T14:11:35Z","content":"Prince Harry acknowledged a rift between his brother, Prince William, and the possibility of moving to Africa in a candid interview with ITV.\r\n USA TODAY\r\nPrince Harry is set to visit Japan Saturday for the 2019 Rugby World Cup Final between England and South… [+2059 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Sara M Moniuszko, USA TODAY","title":"Prince Harry, sans Meghan, makes first official visit to Japan for Rugby World Cup Final","description":"Prince Harry arrived in Japan for the 2019 Rugby World Cup Final between England and South Africa. His wife, Duchess Meghan, did not join him.","url":"https://www.usatoday.com/story/entertainment/celebrities/2019/11/02/prince-harry-visits-japan-sans-meghan-2019-rugby-world-cup-final/4125384002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/11/02/USAT/d6530590-fcea-43b7-b5f8-d92e06778c8d-1185027522.JPG?crop=4349,2447,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-11-02T14:02:45Z","content":"Prince Harry acknowledged a rift between his brother, Prince William, and the possibility of moving to Africa in a candid interview with ITV.\r\n USA TODAY\r\nPrince Harry arrived in Japan on Saturday for the 2019 Rugby World Cup Final between England and South A… [+3102 chars]"},{"source":{"id":null,"name":"Theguardian.comsport"},"author":"Paul Rees in Tokyo","title":"Wales and New Zealand seek to provide fitting send-offs in bronze final","description":"• Warren Gatland still seeking first Wales win over All Blacks • Joseph reportedly now a rival to Foster to succeed Hansen The bronze medal has turned into the crying game. Not because the physical and emotional investment put into their World Cup campaigns b…","url":"https://amp.theguardian.comsport/2019/oct/31/wales-and-new-zealand-bronze-final-rugby-union-world-cup-2019","urlToImage":"https://i.guim.co.uk/img/media/5401d6b3d37fdeb31d2c8f4183fd15c2e3a88d18/30_1268_4132_2479/master/4132.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=14dea9c90e609393c08df2c5c015aa76","publishedAt":"2019-10-31T15:11:21Z","content":"The bronze medal has turned into the crying game. Not because the physical and emotional investment put into their World Cup campaigns by New Zealand and Wales culminates in the anti-climax of a contest in which the winner will still be seen as a loser, but b… [+4175 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Hadas Gold, CNN","title":"Analysis: How Murdoch's many Suns play to both sides of Brexit","description":"On September 5, as the UK's Prime Minister Boris Johnson and opposition Labour leader Jeremy Corbyn brawled in Parliament over Brexit and when to hold a general election, The Sun newspaper took a predictable stance, attacking Corbyn. Alongside an image of Cor…","url":"https://www.cnn.com/2019/10/29/media/murdoch-sun-brexit-gbr-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190618172846-02-rupert-murdoch-super-tease.jpg","publishedAt":"2019-10-29T07:55:53Z","content":"London (CNN)On September 5, as the UK's Prime Minister Boris Johnson and opposition Labour leader Jeremy Corbyn brawled in Parliament over Brexit and when to hold a general election, The Sun newspaper took a predictable stance, attacking Corbyn. Alongside an … [+8002 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"feedback@businessinsider.com (Alan Dawson), Alan Dawson","title":"UFC boss Dana White says there won't be an immediate rematch between Masvidal and Nate Diaz because Jorge was so dominant","description":"YouTube / MMAFightingonSBN Jorge Masvidal beat Nate Diaz in dominant fashion on Saturday. But the UFC 244 fight was not without controversy as an Octagonside doctor stopped the bout because of all the bloody cuts on Diaz's face. The crowd booed and neither fi…","url":"https://www.businessinsider.com/dana-white-masvidal-dominated-diaz-no-need-for-immediate-rematch-2019-11","urlToImage":"https://image.businessinsider.com/5dbf0561e0ee7e6d3c249ea5?width=1200&format=jpeg","publishedAt":"2019-11-03T17:40:14Z","content":"Dana White says there won't be an immediate rematch after Jorge Masvidal beat Nate Diaz so dominantly on Saturday.\r\nDiaz was stopped on his feet after an Octagonside doctor intervened before the start of round four, stopping the bout because of all the bloody… [+2420 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"Express News Service","title":"Springboks’ Catch 22: Kolisi or not","description":"The rugby case for the inspirational but fading South Africa skipper is powerful, but less so from a historical and political perspective.","url":"https://indianexpress.com/article/sports/sport-others/springboks-catch-22-kolisi-or-not-rugby-world-cup-francois-louw-6097189/","urlToImage":"https://images.indianexpress.com/2019/11/siya.jpg?w=759","publishedAt":"2019-10-31T23:46:21Z","content":"Francois Louw has proved better than post-knee-injury Kolisi (pic). (Reuters)\r\nStuart Barnes of The Times who has written extensively on Springboks rugby has struck a chord of disruption with his suggestion that rugby logic dictates that Rassie doesn’t includ… [+5091 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Steve Busfield, Contributor, Steve Busfield, Contributor https://www.forbes.com/sites/stevenbusfield/","title":"Rugby World Cup 2019 Semi-finals: Preview And How To Watch New Zealand vs England, Wales vs South Africa","description":"Will the northern or the southern hemisphere emerge on top from the Rugby World Cup semi-finals?","url":"https://www.forbes.com/sites/stevenbusfield/2019/10/25/rugby-world-cup-2019-semi-finals-preview-and-how-to-watch-new-zealand-vs-england-wales-vs-south-africa/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1177861380%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D5472%26cropY1%3D282%26cropY2%3D3360","publishedAt":"2019-10-25T10:00:00Z","content":"New Zealand's Beauden Barrett and England's Owen Farrell. England will play against New Zealand in ... [+] their 2019 Rugby World Cup semi-final match on October 26 in Japan.\r\nAFP via Getty Images\r\nWill the northern or the southern hemisphere emerge on top fr… [+7284 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Phil Boucher","title":"Queen's Grandson-in-Law Mike Tindall Reveals His Cute (and Unexpected!) Nickname for Wife Zara","description":"From “ GanGan ” to “ Lottie ” and “ BeaBea ” to “ H, ” the royal family’s love of a nickname is well documented. So, it’s no surprise that ex-England rugby star Mike Tindall has a special moniker for wife, Zara Tindall. Speaking at a Rugby World Cup event in …","url":"https://people.com/royals/queens-grandson-in-law-mike-tindall-reveals-his-cute-and-unexpected-nickname-for-wife-zara/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/07/zara-tindall-2.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630","publishedAt":"2019-10-29T18:08:35Z","content":"From “GanGan” to “Lottie” and “BeaBea” to “H,” the royal family’s love of a nickname is well documented. So, it’s no surprise that ex-England rugby star Mike Tindall has a special moniker for wife, Zara Tindall.\r\nSpeaking at a Rugby World Cup event in Tokyo, … [+1506 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"OKC's Steven Adams is rooting for South Africa in the Rugby World Cup","description":"The Oklahoma City Thunder center discusses his rugby fandom and recent criticism of the haka.","url":"https://www.espn.com/nba/story/_/id/27984143/thunder-center-steven-adams-rooting-south-africa-rugby-world-cup","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0125%2Fr493258_1296x729_16%2D9.jpg","publishedAt":"2019-11-01T22:44:56Z","content":"\"Ah, too soon, mate! Too soon!\"\r\nStill feeling the sting of the All Blacks' shocking loss to England in the semifinals of the Rugby World Cup, Steven Adams ambled over with a faux expression of anguish on his face. Adams, a center for the Oklahoma City Thunde… [+5935 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Stephanie Petit","title":"Prince Harry Travels to Japan to Cheer on England in Rugby World Cup Final","description":"Prince Harry went the extra mile (or thousands of miles, in this case) to cheer on England’s rugby team. The royal dad, who is patron of the Rugby Football Union, headed to Japan to see England face off against South Africa in the 2019 Rugby World Cup Final o…","url":"https://people.com/royals/prince-harry-travels-to-japan-to-cheer-on-england-in-rugby-world-cup-final/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/11/prince-harry-e.jpg?crop=0px%2C137px%2C1776px%2C933px&resize=1200%2C630","publishedAt":"2019-11-02T14:08:19Z","content":"Prince Harry went the extra mile (or thousands of miles, in this case) to cheer on England’s rugby team.\r\nThe royal dad, who is patron of the Rugby Football Union, headed to Japan to see England face off against South Africa in the 2019 Rugby World Cup Final … [+3559 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"AP","title":"England meet South Africa in a Rugby World Cup final not for the faint-hearted","description":"During one of England's practice sessions this week, front-rower Kyle Sinckler donned a hoodie and a pair of boxing gloves and started vigorously sparring with a strength-and-conditioning coach.","url":"https://indianexpress.com/article/sports/sport-others/england-meet-south-africa-in-a-rugby-world-cup-final-not-for-the-faint-hearted-6097628/","urlToImage":"https://images.indianexpress.com/2019/11/south-africa-rugby-759.jpg?w=759","publishedAt":"2019-11-01T11:50:42Z","content":"After six weeks, 47 games and one deadly typhoon that briefly wreaked havoc with the first World Cup to be staged in Asia ( Source: Reuters)\r\nDuring one of England’s practice sessions this week, front-rower Kyle Sinckler donned a hoodie and a pair of boxing g… [+6032 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"James Ayles, Contributor, James Ayles, Contributor https://www.forbes.com/sites/jamesayles/","title":"How Technology Can Help Sports Advance After 2019 Rugby World Cup","description":"As the 2019 Rugby World Cup reaches its thrilling conclusion, it’s safe to say this year’s tournament has thrown up endless moments of brilliance – and plenty of talking points.","url":"https://www.forbes.com/sites/jamesayles/2019/11/01/how-technology-can-help-sports-advance-after-2019-rugby-world-cup/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1183879783%2F960x0.jpg","publishedAt":"2019-11-01T11:14:46Z","content":"The 2019 Rugby World Cup has provided many key talking points\r\nWorld Rugby via Getty Images\r\nAs the 2019 Rugby World Cup reaches its thrilling conclusion with England facing South Africa in Saturday's final, its safe to say this years tournament has thrown up… [+14383 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Farrell's rugby rise from baby sitter to England captain","description":"Farrell's rugby rise from baby sitter to England captain","url":"https://www.foxsports.com/rugby/story/farrell-s-rugby-rise-from-baby-sitter-to-england-captain-110119","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-11-01T07:07:52Z","content":"TOKYO (AP) — Inspirational captain. Goalkicker. Tough tackler.\r\nBaby sitter?\r\nOwen Farrell will lead England onto the field for the Rugby World Cup final against South Africa on Saturday and, a couple of hours later, could become only the second Englishman to… [+4718 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":"Victoria Ward","title":"Prince Harry will fly to Japan to support England in the Rugby World Cup Final","description":"The Duke of Sussex, patron of the Rugby Football Union, will fly to Japan to support England in the World Cup final against South Africa, Buckingham Palace announced last night.","url":"https://www.telegraph.co.uk/royal-family/2019/10/28/prince-harry-will-fly-japan-support-england-rugby-world-cup/","urlToImage":"https://www.telegraph.co.uk/content/dam/royal-family/2019/10/28/TELEMMGLPICT000214429443-xlarge_trans_NvBQzQNjv4BqAV_cn36SxFUBspGHt4Ut6WHARTGw2u3VTouegCnov8U.jpeg?imwidth=1200","publishedAt":"2019-10-28T19:33:41Z","content":"Demand for tickets to see England take on South Africa in the Japanese city of Yokohama has seen prices soar, with some seats costing well in excess of £10,000 on resale sites.\r\nOne fan, Mark Jones from Telford, revealed he has spent more than £8,000 on ticke… [+1136 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Hurt after loss, Hansen livid at question of NZ's commitment","description":"Steve Hansen was already hurting after the All Blacks' unbeaten streak at the Rugby World Cup was upended by England","url":"https://www.foxsports.com/rugby/story/hurt-after-loss-hansen-livid-at-question-of-nz-s-commitment-102619","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-26T13:11:12Z","content":"YOKOHAMA, Japan (AP) — Already hurting after the All Blacks’ unbeaten streak at the Rugby World Cup was upended by England, New Zealand head coach Steve Hansen was livid when the commitment of his players was called into question.\r\nHansen had congratulated En… [+3511 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":"Gavin Mairs, Telegraph Sport","title":"Rugby World Cup 2019 prize money and bonuses: how much will England and the players earn from the final?","description":"The World Cup final takes place today and it promises to be the perfect showcase between two enormously talented sides in England and South Africa.","url":"https://www.telegraph.co.uk/rugby-world-cup/2019/11/02/rugby-world-cup-2019-prize-money-bonuses-how-much-england-players/","urlToImage":"https://www.telegraph.co.uk/content/dam/rugby-world-cup/2019/11/01/TELEMMGLPICT000214189350-xlarge_trans_NvBQzQNjv4BqFmZwAHfbzbyjsBBHX-5Jh1FxexswdJIn0JCwl6ikJB0.jpeg?imwidth=1200","publishedAt":"2019-11-02T06:13:23Z","content":"The World Cup final takes place today and it promises to be the perfect showcase between two enormously talented sides in England and South Africa.\r\nEngland stormed past New Zealand 19-7 last weekend in the weekend's most pulsating semi-final, while the Sprin… [+1017 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":"Gavin Mairs, Telegraph Sport","title":"Rugby World Cup 2019 prize money and bonuses: how much will England and the players earn from the final?","description":"The World Cup final is just around the corner and it promises to be the perfect showcase between two enormously talented sides in England and South Africa.","url":"https://www.telegraph.co.uk/rugby-world-cup/2019/11/01/rugby-world-cup-2019-prize-money-bonuses-much-will-england-players/","urlToImage":"https://www.telegraph.co.uk/content/dam/rugby-world-cup/2019/11/01/TELEMMGLPICT000214189350-xlarge_trans_NvBQzQNjv4BqFmZwAHfbzbyjsBBHX-5Jh1FxexswdJIn0JCwl6ikJB0.jpeg?imwidth=1200","publishedAt":"2019-11-01T15:18:53Z","content":"The World Cup final is just around the corner and it promises to be the perfect showcase between two enormously talented sides in England and South Africa.\r\nEngland stormed past New Zealand 19-7 last weekend in the weekend's most pulsating semi-final, while t… [+1025 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"English sporting takeover comes with a twist","description":"England is going through a dominant six-month spell of success in its traditional team sports of football, cricket and rugby","url":"https://www.foxsports.com/rugby/story/english-sporting-takeover-comes-with-a-twist-102719","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-27T08:14:58Z","content":"YOKOHAMA, Japan (AP) — It’s an English sporting takeover with a twist.\r\nFuelled by the brainpower of foreign coaches, England is going through a dominant spell of success in its traditional team sports: Football, cricket and, most recently, rugby.\r\nAnd it has… [+3406 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":"Mick Cleary","title":"England set the tone with response to New Zealand haka but Eddie Jones wants team to finish the job after dethroning 'Gods of Rugby'","description":"Eddie Jones hailed his team&rsquo;s performance at dethroning &lsquo;The Gods of Rugby,&rsquo; to go through to their first World Cup final in 12 years where they will meet the winners of Sunday&rsquo;s semi-final, either South Africa or Wales.","url":"https://www.telegraph.co.uk/rugby-world-cup/2019/10/26/england-set-tone-response-new-zealand-haka-eddie-jones-wants/","urlToImage":"https://www.telegraph.co.uk/content/dam/rugby-world-cup/2019/10/26/TELEMMGLPICT000214175108-xlarge_trans_NvBQzQNjv4Bq7OveF7TwW7JLz8c21xumqjCsfG-oHIptZmeh-2ZNsQg.jpeg?imwidth=1200","publishedAt":"2019-10-26T12:53:43Z","content":"I think its quite a disrespectful question to suggest that the All Blacks turned up not being hungry, said Hansen, whose New Zealand career will come to an end with Fridays bronze medal game in Tokyo, a downbeat finale. Theyre desperate to try and win the gam… [+893 chars]"},{"source":{"id":null,"name":"Nakedcapitalism.com"},"author":"Jerri-Lynn Scofield","title":"Links 11/3/19","description":"Our popular daily Links, including when monkeys attack, Cockburn, Fisk, Pepe Escobar, Stoller, 1MDB, rugby, instant replay, pickle forks, urban design, Facebook, Mattis, Hong Kong, bread, African infrastructure.","url":"https://www.nakedcapitalism.com/2019/11/links-11-3-19.html","urlToImage":"https://www.nakedcapitalism.com/wp-content/uploads/2019/11/photo-1518826141336-8d9d505b49f6-e1572724230102.jpeg","publishedAt":"2019-11-03T11:55:31Z","content":"Four ways that falling back from Daylight Saving Time can kill you TreeHugger\r\n‘Amused us for years’: Rob the unappealing albatross finally finds a mate Guardian (MG)\r\nBoulder weighing 1-ton mysteriously reappears in Arizona forest Fox\r\nViolent and drunk monk… [+4102 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Rugby World Cup 2019: Mapping England’s finalists","description":"The 32 players in the squad to face the Springboks include 16 from the south and five from overseas.","url":"https://www.bbc.co.uk/news/uk-england-50240391","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/1803E/production/_109466389_gettyimages-1184334040.jpg","publishedAt":"2019-11-01T01:38:26Z","content":"Image copyrightGetty ImagesImage caption\r\n England have seen off all-comers so far and have been training hard for the final against South Africa\r\nThe hopes of a nation will be decided on Saturday as England take on South Africa in the Rugby World Cup final.\r… [+5186 chars]"},{"source":{"id":null,"name":"Autoblog.comhttps"},"author":"Reuters","title":"Lewis Hamilton could 'shatter' Michael Schumacher's records","description":"Filed under: Motorsports Mercedes team boss Toto Wolff can see Lewis Hamilton going on to smash Michael Schumacher's greatest Formula One records, the win and title milestones once considered sure to stand the test of time, in years to come. The 34-year-old B…","url":"https://www.autoblog.comhttps://www.autoblog.com/2019/11/03/lewis-hamilton-could-shatter-michael-schumacher-records/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/4336x2439+0+184/resize/800x450!/format/jpg/quality/85/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-11/adf85ff0-fd8e-11e9-bfff-625aa58ed989","publishedAt":"2019-11-03T14:09:52Z","content":"LONDON Mercedes team boss Toto Wolff can see Lewis Hamilton going on to smash Michael Schumacher's greatest Formula One records, the win and title milestones once considered sure to stand the test of time, in years to come.\r\nThe 34-year-old Briton is set to s… [+4057 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"","title":"England, Boks meet in a RWC final not for the faint-hearted","description":"England and South Africa meet in the Rugby World Cup final that will not be for the faint-hearted on Saturday","url":"https://www.foxsports.com/rugby/story/england-boks-meet-in-a-rwc-final-not-for-the-faint-hearted-103119","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-31T10:19:03Z","content":"TOKYO (AP) — During one of England’s practice sessions this week, front-rower Kyle Sinckler donned a hoodie and a pair of boxing gloves and started vigorously sparring with a strength-and-conditioning coach.\r\nWhat better way to prepare for what could prove to… [+4922 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Japan excels as World Cup host, must ride the rugby wave","description":"Japan has excelled as a World Cup host but faces challenge to sustain the rugby fever and keep competitive","url":"https://www.foxsports.com/rugby/story/japan-excels-as-world-cup-host-must-ride-the-rugby-wave-103019","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-30T08:54:01Z","content":"TOKYO (AP) — Three years into his second stint living in Japan, Peter Musgrave takes his young son to a park in central Tokyo and sees people throwing around a rugby ball.\r\n“It’s chalk and cheese to when I first lived here,” the 40-year-old Musgrave says.\r\nBa… [+6892 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":"Telegraph Sport","title":"New Zealand v Wales, Rugby World Cup 2019 third-place play-off: What time is kick-off, what TV channel is it on and what is our prediction?","description":"What is it?","url":"https://www.telegraph.co.uk/rugby-world-cup/2019/10/30/new-zealand-vs-wales-rugby-world-cup-2019-play-off-kick-off/","urlToImage":"https://www.telegraph.co.uk/content/dam/rugby-world-cup/2019/10/29/Capture-xlarge_trans_NvBQzQNjv4BqpJliwavx4coWFCaEkEsb3kvxIt-lGGWCWqwLa_RXJU8.PNG?imwidth=1200","publishedAt":"2019-10-30T08:11:16Z","content":"What is it?\r\nNew Zealand v Wales, the 2019 Rugby World Cup third-place play-off/bronze-medal match. The game no one really wants to play in, but have to, after falling at the final hurdle in the pursuit of a World Cup final place.\r\nThe game either goes the wa… [+607 chars]"},{"source":{"id":null,"name":"Dailymail.co.uk"},"author":"By Hayley Richardson For Mailonline","title":"Belles of Britain! The VERY glamorous Rugby World Cup WAGS cheering on their England and Wales stars","description":"Rugby fans are in for a treat this weekend with two epic clashes, as England takes on reigning champions New Zealand today and Wales play South Africa tomorrow in the World Cup semi-finals.","url":"https://www.dailymail.co.uk/femail/article-7614253/Belles-Britain-glamorous-Rugby-World-Cup-WAGS-cheering-England-Wales-stars.html","urlToImage":"https://i.dailymail.co.uk/1s/2019/10/25/17/20189004-0-image-a-62_1572021120648.jpg","publishedAt":"2019-10-26T07:02:57Z","content":"Rugby fans are in for a treat this weekend with two epic clashes, as England takes on reigning champions New Zealand today and Wales play South Africa tomorrow in the World Cup semi-finals.\r\nThe two British sides will no doubt be grateful for the support of t… [+13526 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":"Telegraph Sport","title":"New Zealand v Wales, Rugby World Cup 2019 third-place play-off: What time is kick-off, what TV channel is it on and what is our prediction?","description":"What is it?","url":"https://www.telegraph.co.uk/rugby-world-cup/2019/10/29/new-zealand-v-wales-rugby-world-cup-2019-third-place-play-off/","urlToImage":"https://www.telegraph.co.uk/content/dam/rugby-world-cup/2019/10/29/Capture-xlarge_trans_NvBQzQNjv4BqpJliwavx4coWFCaEkEsb3kvxIt-lGGWCWqwLa_RXJU8.PNG?imwidth=1200","publishedAt":"2019-10-29T14:42:37Z","content":"What is it?\r\nNew Zealand v Wales, the 2019 Rugby World Cup third-place play-off/bronze-medal match. The game no one really wants to play in, but have to, after falling at the final hurdle in the pursuit of a World Cup final place.\r\nThe game either goes the wa… [+607 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"'Slammin' Sam' leads England's destruction of All Blacks","description":"Sam Underhill was at his marauding best in England's 19-7 win over the All Blacks in the Rugby World Cup semifinals on Saturday","url":"https://www.foxsports.com/rugby/story/slammin-sam-leads-england-s-destruction-of-all-blacks-102619","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-26T15:21:25Z","content":"YOKOHAMA, Japan (AP) — It was a statement tackle, the kind of crunching hit that leaves spectators gasping and gives teammates energy.\r\nThat it took down New Zealand’s leader made it all the more significant.\r\nSam Underhill was crouched and lying in wait on E… [+4008 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Hansen to All Blacks: Bottle the pain, keep it in the pocket","description":"If the reaction to this defeat is anything like their last one at the Rugby World Cup, then all's not lost for the All Blacks","url":"https://www.foxsports.com/rugby/story/hansen-to-all-blacks-bottle-the-pain-keep-it-in-the-pocket-102719","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-27T08:10:42Z","content":"YOKOHAMA, Japan (AP) — If the reaction to this defeat is anything like their last one at the Rugby World Cup, all’s not lost for the All Blacks.\r\nIt may have felt like that in New Zealand on Sunday, with the blank front page on a national newspaper rather tha… [+3623 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Samuel Lovett, Samuel Lovett","title":"England vs New Zealand: Why semi-final defeat confirmed the end of an era for the All Blacks","description":"For all the soul-searching that is to follow this defeat, perhaps it's time for New Zealand and their proud, expectant followers to accept the laws of life: that nothing lasts forever","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/england-vs-new-zealand-rugby-world-cup-2019-all-blacks-steve-hansen-kieran-read-analysis-a9172841.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/27/03/new-zealand.jpg","publishedAt":"2019-10-27T07:47:50Z","content":"Can we call it a dethronement? A changing of the guard, even? While it feels a stretch to suggest that the All Blacks stranglehold on the sport has finally been broken, there was no doubting the significance of Saturdays semi-final. For England, it felt like … [+20640 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Jack de Menezes, Jack de Menezes","title":"England vs New Zealand: Eddie Jones and Owen Farrell reveal why they decided to challenge the All Blacks","description":"England formed a V shape around the All Blacks while they performed the haka, which proved the catalyst for one of the great Rugby World Cup performances","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/england-vs-new-zealand-rugby-world-cup-2019-haka-challenge-video-watch-eddie-jones-owen-farrell-a9172286.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/26/13/haka.jpg","publishedAt":"2019-10-26T11:25:00Z","content":"England decided on responding to the Haka in order to challenge the rugby gods in New Zealand, with Eddie Jones stressing that that the decision to form a V around the All Blacks was part of a plan to prove just how up they were for their Rugby World Cup semi… [+17881 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":"Jonathan Kaplan","title":"Resolute, calm and bold with big decisions: Why Jerome Garces is the right referee for the Rugby World Cup final","description":"Jerome Garces has been given the nod to take charge of the World Cup final between England and South Africa, and the scrutiny on the man in the middle will be huge come Saturday.","url":"https://www.telegraph.co.uk/rugby-world-cup/2019/11/01/resolute-calm-bold-big-decisions-jerome-garces-right-referee/","urlToImage":"https://www.telegraph.co.uk/content/dam/rugby-world-cup/2019/10/31/TELEMMGLPICT000214485276-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200","publishedAt":"2019-11-01T08:00:00Z","content":"Jerome Garces has been given the nod to take charge of the World Cup final between England and South Africa, and the scrutiny on the man in the middle will be huge come Saturday.\r\nBut the Frenchman has what it takes to handle the pressure of the biggest stage… [+1223 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Jack de Menezes, Jack de Menezes","title":"Rugby World Cup 2019: England must embrace fear to fulfil their destiny against South Africa","description":"Eddie Jones' career has come to a type of full-circle since losing the final as Australia coach in 2003. Now, with an England side carved in his image, legacy awaits if they can conquer their nerves","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-england-south-africa-final-preview-team-news-eddie-jones-a9179826.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/31/15/Eddie-Jones.jpg","publishedAt":"2019-11-01T06:58:16Z","content":"What is fear? A feeling caused by many things, that can produce many results. An emotion that can stem from a person, an occasion or an unpleasant memory. But it can only occur in one place, a place that it consumes completely, and that is within the mind.\r\nF… [+20844 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Jonathan Liew, Jonathan Liew","title":"Rugby World Cup 2019: Why talismanic captain Owen Farrell is the ice in England's veins","description":"Since his earliest days on the pitch, the team's leader has carried a strange and powerful infatuation","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-final-2019-england-south-africa-owen-farrell-captain-leader-a9180056.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/31/18/Owen-Farrell.jpg","publishedAt":"2019-11-01T07:56:47Z","content":"Adam Jones tells a funny story about the first time he came across Owen Farrell in international rugby. The year was 2012, Wales were hunting the Triple Crown, and if you were looking for potential weak links in the England line-up, then a 20-year-old fly-hal… [+19362 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"It's a knockout, again, for Wales at the Rugby World Cup","description":"It's a knockout, again, for Wales at the Rugby World Cup","url":"https://www.foxsports.com/rugby/story/it-s-a-knockout-again-for-wales-at-the-rugby-world-cup-102719","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-27T13:05:46Z","content":"YOKOHAMA, Japan (AP) — A 100% success rate against South Africa between Rugby World Cups didn’t translate into a drought-breaking semifinal win for Wales.\r\nIt was close — so close — again. If only they could get it right in the knockouts.\r\nWales extended its … [+4021 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Jonathan Liew, Jonathan Liew","title":"England vs South Africa: Diverse and engaging, how Eddie Jones' history-chasers became likeable","description":"The England men's rugby union team, historically one of the most objectionable sporting teams on the planet, has become weirdly and disconcertingly likeable. They have made a virtue of their wildly diverse origins, both on the pitch and off","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/england-vs-south-africa-rugby-world-cup-final-teams-latest-eddie-jones-a9180286.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/11/01/09/England-training.jpg","publishedAt":"2019-11-01T09:54:07Z","content":"On Thursday, when the RFUs official YouTube channel announced the England team to play South Africa in Saturdays World Cup final, there was a nice little touch included. Alongside each of the players names was a photograph from their childhood days, as well a… [+19605 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Harry Latham-Coyle, Harry Latham-Coyle","title":"Rugby World Cup 2019: Dylan Hartley reveals how Eddie Jones transformed England into elite contenders","description":"The former England captain is confident the team are prepared to upset the All Blacks in the semi-final","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-england-vs-new-zealand-dylan-hartley-interview-eddie-jones-semifinal-all-blacks-a9170391.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/25/07/dylan-hartley-eddie-jones.jpg","publishedAt":"2019-10-25T06:58:00Z","content":"Eddie is a legend. I loved working with him.\r\nThere are few men who know Eddie Jones better than Dylan Hartley. Indeed, there are few men who know Hartley better than Jones.\r\nThe former England captain owes plenty to the Australian. Cast your mind back to the… [+15217 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Jack de Menezes, Jack de Menezes","title":"England top World Rugby rankings for the first time in 15 years ahead of final showdown with Springboks","description":"Eddie Jones's side face South Africa in Saturday's World Cup final not just for the Webb Ellis Cup but also for the right to end the year as the world No 1 side","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-rankings-england-top-15-years-final-vs-south-africa-new-zealand-all-blacks-a9174251.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/26/12/Eddie-Jones.jpg","publishedAt":"2019-10-28T12:13:00Z","content":"England are on top of the World Rugby rankings for the first time in 15 years, with their victory over New Zealand last weekend ahead of what is arguably the biggest week in the teams history.\r\nThe 19-7 win on Saturday night was not only enough to see Eddie J… [+16351 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Jack de Menezes, Jack de Menezes","title":"Rugby World Cup 2019: Ben Spencer to replace injured Willi Heinz in England squad ahead of final","description":"Saracens scrum-half is on his way to replace Heinz after he suffered a hamstring injury in the semi-final victory against New Zealand","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-england-squad-ben-spencer-willi-heinz-injury-japan-a9172836.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/27/02/ben-spencer.jpg","publishedAt":"2019-10-27T02:32:00Z","content":"England have called up Saracens scrum-half Ben Spencer as emergency cover for Willi Heinz for the Rugby World Cup final.\r\nSpencer is due to fly to Japan on Sunday ahead Englands final math in Japan against either South Africa or Wales, with Heinz suffering fr… [+14916 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Jack Rathborn, Jack Rathborn","title":"England vs New Zealand: Epic Rugby World Cup victory over All Blacks in 100 amazing pictures","description":"Eddie Jones's side will now play the winner of Wales vs South Africa in next weekend's World Cup final","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/england-vs-new-zealand-highlights-beat-rugby-world-cup-2019-pictures-a9172106.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/26/11/Mark-Wilson-celebrates-after-England-clinch-victory-over-New-Zealand.jpg","publishedAt":"2019-10-26T09:20:00Z","content":"England produced one of their greatest-ever displays to storm into the Rugby World Cup 2019 final with a 19-7 victory over New Zealand that reduced the reigning champions to a rabble.\r\nFrom the moment Manu Tuilagi crossed after 97 seconds an extraordinary mat… [+14259 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"SBW grateful to end All Blacks career in bronze playoff","description":"SBW grateful to end All Blacks career in bronze playoff at Rugby World Cup","url":"https://www.foxsports.com/rugby/story/sbw-grateful-to-end-all-blacks-career-in-bronze-playoff-103119","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-31T16:18:50Z","content":"Sonny Bill Williams didn’t want to play this week.\r\nThe reaction was natural. Fulltime had just confirmed the stunning end of New Zealand’s eight-year reign as Rugby World Cup champion. Williams was in the middle of Yokohama Stadium last Saturday, getting to … [+4863 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Samuel Lovett, Samuel Lovett","title":"New Zealand vs Wales, Rugby World Cup 2019: How to live stream third-place play-off and watch online","description":"Both head coaches, one captain and a host of other players will be saying farewell to Test rugby in the match","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/new-zealand-vs-wales-live-stream-how-watch-online-rugby-world-cup-2019-latest-a9178661.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/31/04/new-zealand-wales.jpg","publishedAt":"2019-10-31T04:07:00Z","content":"New Zealand and Wales go head to head in the third-place play-off of the Rugby World Cup this Friday in Tokyo.\r\nBoth head coaches, one captain and a host of other players will be saying farewell to Test rugby in the match, with the two teams eager to seek som… [+15520 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Rugby World Cup is the last hurrah for a bunch of greats","description":"All 20 teams include players who know they are not only playing their last Rugby World Cup, but also their last match for their country","url":"https://www.foxsports.com/rugby/story/rugby-world-cup-is-the-last-hurrah-for-a-bunch-of-greats-102719","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-28T02:03:46Z","content":"Rugby World Cups can be a bathtub of tears.\r\nOf the 20 competing teams, 19 will have their hopes dashed. The 20th team won’t be immune, either, as the champion sheds tears of joy.\r\nBut every team has players who know they are not only playing their last Rugby… [+5473 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":"Telegraph Sport","title":"New Zealand v Wales, Rugby World Cup 2019 third-place play-off: What time is kick-off today, what TV channel is it on and what is our prediction?","description":"What is it?","url":"https://www.telegraph.co.uk/rugby-world-cup/2019/11/01/new-zealand-v-wales-rugby-world-cup-2019-third-place-play-off/","urlToImage":"https://www.telegraph.co.uk/content/dam/rugby-world-cup/2019/10/29/Capture-xlarge_trans_NvBQzQNjv4BqpJliwavx4coWFCaEkEsb3kvxIt-lGGWCWqwLa_RXJU8.PNG?imwidth=1200","publishedAt":"2019-11-01T07:21:12Z","content":"What is it?\r\nNew Zealand v Wales, the 2019 Rugby World Cup third-place play-off/bronze-medal match. The game no one really wants to play in, but have to, after falling at the final hurdle in the pursuit of a World Cup final place.\r\nThe game either goes the wa… [+718 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":"Telegraph Sport","title":"New Zealand v Wales, Rugby World Cup 2019 third-place play-off: What time is kick-off tomorrow, what TV channel is it on and what is our prediction?","description":"What is it?","url":"https://www.telegraph.co.uk/rugby-world-cup/2019/10/31/new-zealand-vs-wales-rugby-world-cup-2019-kick-off-time-third-play-off/","urlToImage":"https://www.telegraph.co.uk/content/dam/rugby-world-cup/2019/10/29/Capture-xlarge_trans_NvBQzQNjv4BqpJliwavx4coWFCaEkEsb3kvxIt-lGGWCWqwLa_RXJU8.PNG?imwidth=1200","publishedAt":"2019-10-31T08:09:30Z","content":"What is it?\r\nNew Zealand v Wales, the 2019 Rugby World Cup third-place play-off/bronze-medal match. The game no one really wants to play in, but have to, after falling at the final hurdle in the pursuit of a World Cup final place.\r\nThe game either goes the wa… [+718 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"'We love you South Africa': Kolisi pride after World Cup win","description":"South Africa's multi-racial squad swept to a record-tying third Rugby World Cup title by overpowering England in a poignant and transcendent 32-12 victory.","url":"https://www.foxsports.com/rugby/story/we-love-you-south-africa-kolisi-pride-after-world-cup-win-110219","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-11-02T11:10:29Z","content":"YOKOHAMA, Japan (AP) — Siya Kolisi grabbed the Webb Ellis Cup with his big hands, gave it a kiss and hoisted it high as fireworks exploded and his teammates — black and white — rejoiced behind him.\r\nA blowout victory in the Rugby World Cup final for the Sprin… [+4016 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Sports Staff, Sports Staff","title":"Tonga shock Australia in huge rugby league upset","description":"The loss was Australia's first defeat to a side other than New Zealand, England or Britain since being beaten by France in 1978.","url":"https://www.independent.co.uk/sport/rugby/rugby-league/tonga-vs-australia-result-rugby-league-test-upset-shock-great-britain-new-zealand-a9182211.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/11/02/12/tonga-beat-australia.jpg","publishedAt":"2019-11-02T12:33:00Z","content":"Tonga pulled off one of the biggest upsets in rugby league history by becoming the first tier-two country to beat Australia with a 16-12 victory at Eden Park.\r\nThe loss was Australias first defeat to a side other than New Zealand, England or Great Britain sin… [+554 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Top quotes from the Rugby World Cup","description":"Top quotes from the Rugby World Cup","url":"https://www.foxsports.com/rugby/story/top-quotes-from-the-rugby-world-cup-110319","urlToImage":"https://b.fssta.com/uploads/2019/11/a207e7278f4d4debbb7f01a006bd5631-1.vresize.1200.630.high.43.jpg","publishedAt":"2019-11-03T08:58:28Z","content":"TOKYO (AP) — The best quotes from the Rugby World Cup in Japan:\r\n“We’d consider Ireland a very welcoming country, but Japan takes that to a different level.”\r\nIreland flanker Peter O’Mahony.\r\n“I thought I was going to die with all the pressure.”\r\nJapan flyhal… [+8417 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":"Alan Tyers","title":"New Zealand vs England, second T20: live score and latest updates from Wellington","description":"Well, it might have been quite a long day for some England sports fans.","url":"https://www.telegraph.co.uk/cricket/2019/11/02/new-zealand-vs-england-second-t20-live-score-latest-updates/","urlToImage":"https://www.telegraph.co.uk/content/dam/cricket/2019/11/02/TELEMMGLPICT000214282060_1-xlarge_trans_NvBQzQNjv4Bqz8PrEBUoq2NOeDT9dFlgS5zo8_eVaYsgfgaGHBq6Cl8.jpeg?imwidth=1200","publishedAt":"2019-11-02T23:35:03Z","content":"Well, it might have been quite a long day for some England sports fans. Sorry to rugby lovers that the team didn't get the result we were all hoping for, but perhaps the England cricketers can go some (tiny) way to making up for that disappointment with a T20… [+1257 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jarrett Bellini, CNN","title":"Japan 2019: The joy of sleeping in a capsule hotel","description":"It's a short ride from Kyoto to Osaka. And like all our other rail journeys throughout Japan, we accessorized the experience with snacks from 7-Eleven.","url":"https://edition.cnn.com/2019/10/30/sport/rugby-world-cup-japan-2019-travel-spt-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/191029083423-capsule-hotel-super-tease.jpg","publishedAt":"2019-10-30T10:24:57Z","content":"Jarrett Bellini writes a fan diary of his experience at the Rugby World Cup. You can read his previous entries here and here. \r\n (CNN)It's a short ride from Kyoto to Osaka. And like all our other rail journeys throughout Japan, we accessorized the experience … [+6081 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Gatland, the eternal optimist, urges Wales to 'dream' at RWC","description":"Wales rugby coach Warren Gatland says he is a dreamer and \"probably the greatest optimist in terms of believing something is possible.\"","url":"https://www.foxsports.com/rugby/story/gatland-the-eternal-optimist-urges-wales-to-dream-at-rwc-102519","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-25T06:27:16Z","content":"TOKYO (AP) — Wales rugby coach Warren Gatland is a dreamer, so the thought of taking the silver Webb Ellis Cup back to his native New Zealand and his family home in Waihi Beach has invariably crossed his mind.\r\n“One of the things about me,” Gatland said Frida… [+3985 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Samuel Lovett, Samuel Lovett","title":"England vs South Africa, Rugby World Cup final: Will there be a victory parade for Eddie Jones' men if they beat the Springboks?","description":"Should England emerge victorious from today's final, they'll be treated to a victory parade in central London. Here, we take you through the details","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/england-vs-south-africa-rugby-world-cup-final-victory-parade-london-when-details-a9181961.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/11/02/04/engand-south-africa.jpg","publishedAt":"2019-11-02T04:02:00Z","content":"England can claim a second Rugby World Cup title when they take on South Africa in todays final in Yokohama.\r\nWhereas the Springboks are chasing a third world title, having previously won the tournament in 1995 and 2007, the English are looking to add to thei… [+15594 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Japan excels as World Cup host, must ride the rugby wave","description":"Japan has excelled as a World Cup host but faces challenge to sustain the rugby fever and keep competitive","url":"https://www.foxsports.com/rugby/story/japan-excels-as-world-cup-host-must-ride-the-rugby-wave-110319","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-11-03T08:53:16Z","content":"TOKYO (AP) — Three years into his second stint living in Japan, Peter Musgrave takes his young son to a park in central Tokyo and sees people throwing around a rugby ball.\r\n“It’s chalk and cheese to when I first lived here,” the 40-year-old Musgrave says.\r\nBa… [+6794 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":null,"title":"Eight ways to make the most out of your Telegraph subscription","description":null,"url":"https://www.telegraph.co.uk/contact-us/eight-reasons-why/","urlToImage":null,"publishedAt":"2019-10-29T15:46:30Z","content":"1) Premium articles \r\nAs a subscriber, you can enjoy unlimited access to all premium articles. Denoted by the premium label, these articles comprise the very best of The Telegraphs journalism, from agenda-setting political analysis and financial insight to wo… [+2731 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Siya's Springboks are exactly what Mandela envisioned","description":"Siya Kolisi's Rugby World Cup-winning Springboks are exactly what Mandela envisioned 24 years ago","url":"https://www.foxsports.com/rugby/story/siya-s-springboks-are-exactly-what-mandela-envisioned-110219","urlToImage":"https://b.fssta.com/uploads/2019/11/3d7d5d4228774071b781f08892b7b21e.vresize.1200.630.high.26.jpg","publishedAt":"2019-11-02T23:50:53Z","content":"SOMERSET WEST, South Africa (AP) — Black and white, they sat together on the edge of the dusty township street where Nelson Mandela once lived and watched their Springboks win the Rugby World Cup again.\r\nThe late Mandela would surely have liked what he saw — … [+6343 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Samuel Lovett, Samuel Lovett","title":"England vs South Africa: Rugby World Cup 2019 prize money and bonuses – how much will the players earn?","description":"It's not just immortality and glory on offer in today's final but the promise of some handsome-looking bonuses","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/england-vs-south-africa-rugby-world-cup-2019-prize-money-bonuses-how-much-a9181946.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/11/02/03/england-south-africa.jpg","publishedAt":"2019-11-02T02:59:00Z","content":"England and South Africa have the chance to write themselves into the history books as they meet in the final of the Rugby World Cup today.\r\nWhereas the Springboks are chasing a third world title, having previously won the tournament in 1995 and 2007, the Eng… [+16090 chars]"},{"source":{"id":"abc-news-au","name":"ABC News (AU)"},"author":null,"title":"England fined for response to All Blacks' haka at World Cup","description":"As it prepares for the Rugby World Cup decider, England is hit with a fine for its reaction to New Zealand's haka before their epic semi-final in Japan last weekend.","url":"https://www.abc.net.au/news/2019-10-30/rugby-world-cup-england-fined-for-haka-response/11654388","urlToImage":"https://www.abc.net.au/news/image/11643780-16x9-700x394.jpg","publishedAt":"2019-10-30T05:01:14Z","content":"Posted \r\nOctober 30, 2019 16:01:14\r\nEngland has been fined for its response to the haka before last Saturday's Rugby World Cup semi-final victory over New Zealand in Yokohama.\r\nKey points:\r\n<ul><li>England was handed an undisclosed fine for advancing \"beyond … [+2950 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Chris Ashton, Chris Ashton","title":"England vs New Zealand: How to beat the unbeatable All Blacks – the Chris Ashton column","description":"The 44-cap England wing writes for The Independent on how it feels to have beaten New Zealand seven years ago and why Eddie Jones's squad can achieve the same in the Rugby World Cup semi-finals","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/england-vs-new-zealand-rugby-world-cup-2019-rwc-chris-ashton-column-beat-all-blacks-manu-tuilagi-a9170586.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/25/09/chris-ashton.jpg","publishedAt":"2019-10-25T07:15:00Z","content":"Its a special name because its not what theyre called, yet we all know them as the All Blacks. Its a name that puts the fear of God into everybody when youre playing them because they have been forever and a day the best team in the world. But theres also a b… [+9218 chars]"},{"source":{"id":"abc-news-au","name":"ABC News (AU)"},"author":"Luke Pentony","title":"Football didn't come home to England last year, so will the Rugby World Cup?","description":"South Africa will back its chances of an upset victory in tomorrow night's Rugby World Cup final in Yokohama but it's England title to lose, as Eddie Jones closes in on his crowning glory.","url":"https://www.abc.net.au/news/2019-11-01/rugby-union-world-cup-england-favourite-to-beat-south-africa/11653590","urlToImage":"https://www.abc.net.au/news/image/11658894-16x9-700x394.jpg","publishedAt":"2019-10-31T18:53:45Z","content":"Posted \r\nNovember 01, 2019 05:53:45\r\nFootball was meant to come home to England at last year's FIFA World Cup, and while that did not go according to plan, its men's rugby union team finds itself on the cusp of global domination.\r\nComing off their stunning 19… [+6655 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Jack Tarrant, Jack Tarrant","title":"Wales vs South Africa: Siya Kolisi wants Springboks to emulate great sides of the past the united Rainbow Nation","description":"The captain wants to unite the Rainbow Nation with victory in Japan","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/wales-vs-south-africa-siya-kolisi-springboks-japan-rugby-world-cup-2019-a9171951.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/26/08/Siya-Kolisi-wants-the-Springboks-to-take-inspiration-from-the-previous-great-teams.jpg","publishedAt":"2019-10-26T06:07:00Z","content":"Springboks captain Siya Kolisi knows what an impact winning the Rugby World Cup can have on his country, having seen how uplifting victories in 1995 and 2007 were for South Africa.\r\nOn the eve of leading his team into a World Cup semi-final against Wales on S… [+8788 chars]"},{"source":{"id":"abc-news-au","name":"ABC News (AU)"},"author":"Richard Hinds","title":"England is ruling the world with Australian coaches, so where are we going wrong?","description":"With England on the cusp of more global domination at a World Cup with an Aussie at the helm, the calls are out to bring these coaches home. But doing so ignores the root of Australia's problems, writes Richard Hinds.","url":"https://www.abc.net.au/news/2019-10-28/england-is-ruling-the-world-with-australian-coaches/11644380","urlToImage":"https://www.abc.net.au/news/image/11644398-16x9-700x394.jpg","publishedAt":"2019-10-27T19:19:58Z","content":"Posted \r\nOctober 28, 2019 06:19:58\r\nThe English invent sports and Australian coaches show them how to play them.\r\nThis is the only conclusion to be reached after England's ICC World Cup victory under the guidance of a top bloke from Goulburn, Trevor Bayliss, … [+5500 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":null,"title":"Eight ways to make the most out of your subscription with The Telegraph","description":null,"url":"https://www.telegraph.co.uk/contact-us/most-of-your-subscription/","urlToImage":null,"publishedAt":"2019-10-30T11:24:04Z","content":"1. Premium articles\r\nAs a subscriber, you can enjoy unlimited access to all premium articles. Denoted by the premium label, these articles comprise the very best of The Telegraphs journalism, from agenda-setting political analysis and financial insight to wor… [+2830 chars]"},{"source":{"id":null,"name":"Gartner.com"},"author":"Andrew White","title":"Upgrade you Data (and Analytics) Strategy – Now!","description":"I was up at 4am last Saturday (before Orlando Symposium) in order to watch England take on New Zealand in the first semi-final of the Rugby World Cup 2019 in Japan. I certainly didn’t feel as tired as I thought I would at the end, probably since England won t…","url":"https://blogs.gartner.com/andrew_white/2019/11/01/upgrade-data-analytics-strategy-now/","urlToImage":null,"publishedAt":"2019-11-01T12:12:27Z","content":"I was up at 4am last Saturday (before Orlando Symposium) in order to watch England take on New Zealand in the first semi-final of the Rugby World Cup 2019 in Japan. I certainly didnt feel as tired as I thought I would at the end, probably since England won th… [+4341 chars]"},{"source":{"id":null,"name":"Telegraph.co.uk"},"author":"Telegraph Sport","title":"England v New Zealand, Rugby World Cup 2019 semi-final: What time is kick-off, what TV channel is it on and what are the latest odds?","description":"What is it?","url":"https://www.telegraph.co.uk/rugby-world-cup/2019/10/25/england-vs-new-zealand-rugby-world-cup-2019-semi-final-kick-off-time/","urlToImage":"https://www.telegraph.co.uk/content/dam/rugby-world-cup/2019/10/19/TELEMMGLPICT000213463698-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200","publishedAt":"2019-10-25T06:59:20Z","content":"Certainly England will provide a better test for the holders, having earlier thrashed Australia 40-16 in the first quarter-final in Oita. \r\nNew Zealand's route\r\nMATCH ONE\r\nNew Zealand 23 South Africa 13... International Stadium Yokohama... Saturday, September… [+992 chars]"},{"source":{"id":null,"name":"Firstpost.com"},"author":"Agence France-Presse","title":"Rugby World Cup 2019: England hope to stop New Zealand juggernaut in blockbuster semi-final clash","description":"Reigning champions New Zealand and England clash in a heavyweight Rugby World Cup semi-final on Saturday after a build-up marked by spying claims and a game of tactical cat-and-mouse. The post Rugby World Cup 2019: England hope to stop New Zealand juggernaut …","url":"https://www.firstpost.com/sports/rugby-world-cup-2019-england-hope-to-stop-new-zealand-juggernaut-in-blockbuster-semi-final-clash-7558351.html","urlToImage":"https://images.firstpost.com/wp-content/uploads/2019/10/England-rugby-training-New-Zealand-AP-social.jpg","publishedAt":"2019-10-26T07:43:49Z","content":"Yokohama: Reigning champions New Zealand and England clash in a heavyweight Rugby World Cup semi-final on Saturday after a build-up marked by spying claims and a game of tactical cat-and-mouse.\r\nThe All Blacks are defending a record 18-match World Cup winning… [+3566 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"Mark Landler and Stephen Castle","title":"Boris Johnson Has Big Lead in U.K. Election. That Might Not Mean Much.","description":"In Britain’s Brexit-scrambled politics, four parties are competing and the winning margins will be narrow. Nothing in this campaign is likely to go as the experts predict.","url":"https://www.nytimes.com/2019/11/02/world/europe/brexit-uk-election-johnson-trump.html","urlToImage":"https://static01.nyt.com/images/2019/11/03/world/03uk-election/03uk-election-facebookJumbo.jpg","publishedAt":"2019-11-02T04:01:20Z","content":"Mr. Farage could also hammer Mr. Johnson for failing to pull Britain out of the European Union on Oct. 31, as he promised, or for his deal with Brussels, which Mr. Farage claims will align Britain too closely with Europe and, as Mr. Trump said, impede a trade… [+1774 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"STEVE DOUGLAS","title":"Farrell’s rugby rise from baby sitter to England captain","description":"TOKYO (AP) — Inspirational captain. Goalkicker. Tough tackler. Baby sitter? Owen Farrell will lead England onto the field for the Rugby World Cup final against South Africa on Saturday and, a couple of hours later, could become only the second Englishman to l…","url":"https://www.seattletimes.com/sports/farrells-rugby-rise-from-baby-sitter-to-england-captain/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/11/urn-publicid-ap-org-535e3368ac224f84adfc5c2eff2f9963Japan_Rugby_WCup_England_04196-1200x630.jpg","publishedAt":"2019-11-01T07:07:52Z","content":"TOKYO (AP) Inspirational captain. Goalkicker. Tough tackler.\r\nBaby sitter?\r\nOwen Farrell will lead England onto the field for the Rugby World Cup final against South Africa on Saturday and, a couple of hours later, could become only the second Englishman to l… [+4853 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"South Africa celebrates rugby world cup win over England","description":"The Springboks claim their third world cup title after 32-12 victory.","url":"https://www.bbc.co.uk/news/world-africa-50273318","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/9614/production/_109502483_hi057719086.jpg","publishedAt":"2019-11-02T11:04:35Z","content":"Image copyrightAll Sport\r\nSouth Africans have been celebrating after their rugby team beat England in the world cup final in Japan.\r\nThe victory under Siya Kolisi, the team's first black captain, was another symbolic moment for the Springboks.\r\nIn 1995, forme… [+953 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Harry Latham-Coyle, Harry Latham-Coyle","title":"Wales vs South Africa: The one thing England should fear about the Springboks","description":"South Africa's semi-final victory was built on defence and forward might, and England will have to more than match them in that regard next weekend","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-wales-vs-south-africa-england-semi-final-final-analysis-a9173006.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/27/11/Wales-vs-South-Africa.jpg","publishedAt":"2019-10-27T11:17:00Z","content":"It was a World Cup semi-final for the rugby purist. Seldom did the game break from a plodding pace as both sides played their structured, slow games, kicking for territory and content to play one-out rugby more often than not.\r\nWales and South Africa both pos… [+8508 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Jack de Menezes, Samuel Lovett, Jonathan Liew, Jack de Menezes, Samuel Lovett, Jonathan Liew","title":"The Indy Rugby Podcast: England deliver one of the all-time great performances to beat the All Blacks","description":"Jack de Menezes is joined by Jonathan Liew, Samuel Lovett and Ruaidhri O'Connor to recap on a magical night in Yokohama","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/the-indy-rugby-podcast-world-cup-japan-2019-england-vs-new-zealand-all-blacks-a9172846.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/07/09/rugby-podcast.png","publishedAt":"2019-10-27T08:05:57Z","content":"England delivered one of the great Rugby World Cup performances of all time to reach the final of Japan 2019, beating reigning champions New Zealand 19-7 on a special night in Yokohama.\r\nEddie Joness side never looked like losing the match from the moment the… [+1207 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"George Ramsay, CNN","title":"80 minutes from glory: Can South Africa upset favorites England?","description":"After six weeks and 44 games, the Rugby World Cup boils down to 80 minutes between England and South Africa.","url":"https://edition.cnn.com/2019/10/31/sport/south-africa-england-rugby-world-cup-final-spt-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/191031125032-web-ellis-trophy-super-tease.jpg","publishedAt":"2019-10-31T13:02:49Z","content":"(CNN)After six weeks and 44 games, the Rugby World Cup boils down to 80 minutes between England and South Africa.\r\nA new champion will be crowned in Yokohama on Saturday after England robbed the All Blacks of the chance to win a third consecutive title, the b… [+4595 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"John Pye","title":"Scrum to be crucial in New Zealand vs England semifinal","description":"TOKYO (AP) — It’s the contest within the contest. A collision between two masses of muscle, the scrum will be pivotal in the Rugby World Cup semifinal between defending champion New Zealand and England, which prides itself on being dominant at the set piece. …","url":"https://www.seattletimes.com/sports/scrum-to-be-crucial-in-new-zealand-vs-england-semifinal/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-10-25T09:09:09Z","content":"TOKYO (AP) It’s the contest within the contest. A collision between two masses of muscle, the scrum will be pivotal in the Rugby World Cup semifinal between defending champion New Zealand and England, which prides itself on being dominant at the set piece.\r\nE… [+3713 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"John Pye","title":"Springboks captain Kolisi gets his chance to make history","description":"TOKYO (AP) — It was the week after Siya Kolisi’s fourth birthday in 1995 when Nelson Mandela presented Springboks captain Francois Pienaar with the Webb Ellis Cup in a defining moment for rugby, and for South Africa. Kolisi was 16 when the Springboks won thei…","url":"https://www.seattletimes.com/nation-world/nation/springboks-captain-kolisi-gets-his-chance-to-make-history/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-10-31T02:00:43Z","content":"TOKYO (AP) It was the week after Siya Kolisi’s fourth birthday in 1995 when Nelson Mandela presented Springboks captain Francois Pienaar with the Webb Ellis Cup in a defining moment for rugby, and for South Africa.\r\nKolisi was 16 when the Springboks won their… [+5137 chars]"},{"source":{"id":null,"name":"Firstpost.com"},"author":"Agence France-Presse","title":"Rugby World Cup 2019: South Africa’s boring tactics, England’s strategy in face of haka and other talking points from semis","description":"South Africa will take on England in the final of the 2019 Rugby World Cup after vanquishing the challenges of Wales and New Zealand. Here are the biggest talking points from both semi-finals: The post Rugby World Cup 2019: South Africa’s boring tactics, Engl…","url":"https://www.firstpost.com/sports/rugby-world-cup-2019-south-africas-boring-tactics-englands-strategy-in-face-of-haka-and-other-talking-points-from-semis-7565411.html","urlToImage":"https://images.firstpost.com/wp-content/uploads/2019/10/Jake-Ball-raw_opt-1.jpg","publishedAt":"2019-10-29T04:17:37Z","content":"South Africa will take on England in the final of the 2019 Rugby World Cup after vanquishing the challenges of Wales and New Zealand.\r\nIn Yokohama, England rode into the final with a spectacular 19-7 defeat of the All Blacks on Saturday a day before South Afr… [+5613 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Terry Kirby, Terry Kirby","title":"Wines of the week: What to drink to celebrate the Rugby World Cup 2019 final","description":"It may start at 9am, but considering England are in the final it's never too early to drink, says Terry Kirby","url":"https://www.independent.co.uk/life-style/food-and-drink/rugby-world-cup-2019-final-wine-what-to-drink-celebrate-a9177691.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/31/15/wine-pics-2-november-2019-head.jpg","publishedAt":"2019-11-01T13:15:08Z","content":"The Rugby World Cup final this morning may well be all over by the time you read this and while I certainly dont normally recommend any wine to be drunk at such an early hour in the UK, it is permissible, I think, to have a glass of fizz for elevenses if your… [+5790 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"","title":"'It won't be the prettiest': Wales, Springboks meet in semis","description":"'It won't be the prettiest': Wales, Springboks meet in semis","url":"https://www.foxsports.com/rugby/story/it-won-t-be-the-prettiest-wales-springboks-meet-in-semis-102519","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-25T09:29:28Z","content":"TOKYO (AP) — Wales and South Africa have gone about their business quietly in Tokyo this week, avoiding the barbs, cheap shots, claims and counter-claims that have marked the buildup to the other Rugby World Cup semifinal this weekend.\r\nNew Zealand vs. Englan… [+3261 chars]"},{"source":{"id":"the-hindu","name":"The Hindu"},"author":"AFP","title":"Rugby World Cup final: England faces daunting task against South Africa","description":"South Africa are probably one of the few sides capable of repelling England in their current form.","url":"https://www.thehindu.com/sport/other-sports/rugby-world-cup-final-england-faces-daunting-task-against-south-africa/article29856377.ece","urlToImage":"https://www.thehindu.com/sport/other-sports/3953g2/article29856376.ece/ALTERNATES/LANDSCAPE_615/RUGBYWCFINAL","publishedAt":"2019-11-01T14:59:58Z","content":"England face the daunting task of trying to match or even improve upon their stunning win over New Zealand when they face South Africa in the World Cup final.\r\nEddie Jones's men will head into Saturdays showpiece in Yokohama as favourites after a superb 19-7 … [+3476 chars]"},{"source":{"id":null,"name":"Bbc.com"},"author":"https://www.facebook.com/bbcnews","title":"South Africa celebrates rugby world cup win over England - BBC News","description":"South Africa celebrates rugby world cup win over England BBC News Rugby World Cup final: why size will matter | The Economist The Economist Prince Harry sends good luck photo of Archie in Red Rose jersey to England rugby team Yahoo Style Rugby World Cup final…","url":"https://www.bbc.com/news/world-africa-50273318","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/18650/production/_109502999_hi057719210.jpg","publishedAt":"2019-11-02T12:25:09Z","content":"Image copyrightAFPImage caption\r\n Fans at a viewing centre in Johannesburg cried and hugged at the end of the game\r\nSouth Africans have been celebrating after their rugby team beat England 32-12 in the world cup final in Japan.\r\nThe victory under Siya Kolisi,… [+2409 chars]"},{"source":{"id":"rt","name":"RT"},"author":"RT","title":"From a 6ft 8in giant to a man nicknamed The Beast: Meet the England & South Africa players set to collide in Rugby World Cup final","description":"Rugby union is one of the most physically demanding sports on earth and it is of little surprise that the the teams who meet in this Saturday's World Cup Final are two of the most physically imposing in the sport. Read Full Article at RT.com","url":"https://www.rt.com/sport/472125-players-england-south-africa-rugby-world-cup-final/","urlToImage":"https://cdni.rt.com/files/2019.10/article/5db86cbc20302760c17e3a64.jpg","publishedAt":"2019-10-29T17:00:57Z","content":"Despite the impact of Typhoon Hagibis which played havoc with some of the group fixtures (and perhaps dependent on your personal international rugby loyalties), it is difficult to say that the 2019 iteration of the Rugby World Cup hasn't been a rousing succes… [+6251 chars]"},{"source":{"id":null,"name":"Channelnewsasia.com"},"author":"CNA","title":"'Finishers' face off against 'Bomb Squad' in 21st century final","description":"England coach Eddie Jones has long asserted that 21st century rugby is a 23-man game and the battle between his eight \"finishers\" and South Africa's \"Bomb Squad\" bench could have a big influence on Saturday's Rugby World Cup final.","url":"https://www.channelnewsasia.com/news/sport/-finishers--face-off-against--bomb-squad--in-21st-century-final-12054788","urlToImage":"https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12054786/16x9/991/557/4174cf3982989dec0227af41b3502efb/RP/rugby-world-cup---final---england-captain-s-run-3.jpg","publishedAt":"2019-11-01T06:50:54Z","content":"TOKYO, Japan: England coach Eddie Jones has long asserted that 21st century rugby is a 23-man game and the battle between his eight \"finishers\" and South Africa's \"Bomb Squad\" bench could have a big influence on Saturday's Rugby World Cup final.\r\nOnly injury … [+2590 chars]"},{"source":{"id":"vice-news","name":"Vice News"},"author":"Moustafa Ayad, Jason Koebler","title":"Twitter Has Been Flooded With ISIS Propaganda Since al Baghdadi's Death","description":"Twitter continues to struggle to take down bots that post in Arabic. Hundreds of accounts have posted videos, audio, and photos that have been viewed tens of thousands of times.","url":"https://www.vice.com/en_us/article/9kevpp/twitter-has-been-flooded-with-isis-propaganda-since-al-baghdadis-death","urlToImage":"https://video-images.vice.com/articles/5dbc62db3441830092198580/lede/1572627889200-GettyImages-1179075959.jpeg?crop=1xw:0.8425xh;0xw,0xh&resize=1200:*","publishedAt":"2019-11-01T17:09:34Z","content":"Moustafa Ayad is the Deputy Director of International Technology, Communications and Education at the ISD, an international group fighting terrorism, extremism, and fascism.\r\n In the moments on Twitter following the breaking news of ISIS leader Abu Bakr al-Ba… [+8281 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Jack de Menezes, Jack de Menezes","title":"The Indy Rugby Podcast: Wales fall short once again as Springboks strangle their way to World Cup final","description":"Jack de Menezes is joined by Duncan Bech to discuss the fallout from semi-final weekend at the Rugby World Cup and look forward to Saturday's final – and the dreaded third-place play-off","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/the-indy-rugby-podcast-world-cup-2019-wales-vs-south-africa-springboks-final-england-a9173786.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/07/09/rugby-podcast.png","publishedAt":"2019-10-28T07:14:00Z","content":"With both semi-finals of the Rugby World Cup done and dusted, we now know that England and South Africa will battle it out for the right to be crowned world champions at Japan 2019.\r\nFollowing on from Englands heroics against New Zealand on Saturday, the Spri… [+2889 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Erasmus and co have Boks poised for a 3rd World Cup title","description":"Erasmus and co have Boks poised for a 3rd World Cup title","url":"https://www.foxsports.com/rugby/story/erasmus-and-co-have-boks-poised-for-a-3rd-world-cup-title-102919","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-29T10:25:56Z","content":"TOKYO (AP) — The man who has shaped the Springboks revival decided to take a back seat for a while.\r\nRassie Erasmus had delivered his team news for a Rugby World Cup knockout game, 24 hours ahead of schedule, and answered questions in front of the cameras.\r\nT… [+5072 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"John Pye","title":"Hurt after loss, Hansen livid at question of NZ’s commitment","description":"YOKOHAMA, Japan (AP) — Already hurting after the All Blacks’ unbeaten streak at the Rugby World Cup was upended by England, New Zealand head coach Steve Hansen was livid when the commitment of his players was called into question. Hansen had congratulated Eng…","url":"https://www.seattletimes.com/sports/hurt-after-loss-hansen-livid-at-question-of-nzs-commitment/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/10/urn-publicid-ap-org-2018e96c4fdf47f7af8a6454ac26ccf5Japan_Rugby_WCup_New_Zealand_England_24563-1200x630.jpg","publishedAt":"2019-10-26T13:11:12Z","content":"YOKOHAMA, Japan (AP) Already hurting after the All Blacks’ unbeaten streak at the Rugby World Cup was upended by England, New Zealand head coach Steve Hansen was livid when the commitment of his players was called into question.\r\nHansen had congratulated Engl… [+3605 chars]"},{"source":{"id":null,"name":"Firstpost.com"},"author":"Agence France-Presse","title":"Rugby World Cup 2019: ‘We owe them one’, Wales seek revenge against South Africa in semi-final","description":"Six Nations champions Wales will be out for revenge in their Rugby World Cup semi-final against Rugby Championship title-holders South Africa in Yokohama on Sunday. The post Rugby World Cup 2019: ‘We owe them one’, Wales seek revenge against South Africa in s…","url":"https://www.firstpost.com/sports/rugby-world-cup-2019-we-owe-them-one-wales-seek-revenge-against-south-africa-in-semi-final-7558361.html","urlToImage":"https://images.firstpost.com/wp-content/uploads/2019/10/Wales-training-South-Africa-semi-final-RWC-AP-social.jpg","publishedAt":"2019-10-26T08:32:12Z","content":"Yokohama: Six Nations champions Wales will be out for revenge in their Rugby World Cup semi-final against Rugby Championship title-holders South Africa in Yokohama on Sunday.\r\nWhile the Welsh have won the last four Tests between the two sides (after winning j… [+3619 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Springboks captain Kolisi gets his chance to make history","description":"Springboks captain Kolisi gets his chance to make history","url":"https://www.foxsports.com/rugby/story/springboks-captain-kolisi-gets-his-chance-to-make-history-103019","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-10-31T02:00:43Z","content":"TOKYO (AP) — It was the week after Siya Kolisi’s fourth birthday in 1995 when Nelson Mandela presented Springboks captain Francois Pienaar with the Webb Ellis Cup in a defining moment for rugby, and for South Africa.\r\nKolisi was 16 when the Springboks won the… [+5051 chars]"},{"source":{"id":null,"name":"Stuff.co.nz"},"author":"TONY SMITH","title":"Rugby World Cup: World Rugby decision to fine England for haka response is hypocrisy","description":"OPINION: You can't have it both ways, World Rugby - promote an \"incredible'' haka response then fine England for creativity.","url":"https://www.stuff.co.nz/sport/rugby/rugby-world-cup/rwc-2019-japan/117017810/rugby-world-cup-world-rugby-decision-to-fine-england-for-haka-response-is-hypocrisy","urlToImage":"https://resources.stuff.co.nz/content/dam/images/1/x/m/p/c/6/image.related.StuffLandscapeSixteenByNine.1420x800.1xo3iq.png/1572390327005.jpg","publishedAt":"2019-10-29T23:05:27Z","content":"OPINION: World Rugby has reached new heights of hypocrisy by fining England for its haka hijinks just a  couple of days after promoting it online.\r\n The game's governing body posted a video in its social media channels lauding \"England's incredible response t… [+4582 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Jack de Menezes, Jack de Menezes","title":"Rugby World Cup 2019: Eddie Jones ready to stick with George Ford for final as England receive haka fine","description":"Ford was dropped to the bench for the quarter-final victory over Australia but returned to fly-half to lead England to victory over New Zealand – though the RFU have been fined for the confrontation to the haka last weekend","url":"https://www.independent.co.uk/sport/rugby/rugby-union/international/england-vs-south-africa-rugby-world-cup-2019-final-team-news-george-ford-haka-fine-a9176576.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/29/17/owen-farrell.jpg","publishedAt":"2019-10-29T23:17:35Z","content":"Eddie Jones is prepared to stick with the midfield combination that ended New Zealands reign of dominance at the Rugby World Cup, though Englands plans for Saturdays final against South Africa were hit with a setback on Tuesday after World Rugby fined them fo… [+15900 chars]"},{"source":{"id":null,"name":"Japantoday.com"},"author":null,"title":"'It just happens': Jones, England fall short in RWC final","description":"England's team bus was held up in pre-match traffic, so the players arrived later than planned at the International Stadium in Yokohama for the Rugby World Cup final. Some will say they never really turned up at all. A week after delivering quite possibly the…","url":"https://japantoday.com/category/rugby-world-cup-2019/%27it-just-happens%27-jones-england-fall-short-in-rwc-final","urlToImage":null,"publishedAt":"2019-11-02T21:37:59Z","content":"England's team bus was held up in pre-match traffic, so the players arrived later than planned at the International Stadium in Yokohama for the Rugby World Cup final.\r\nSome will say they never really turned up at all.\r\nA week after delivering quite possibly t… [+4246 chars]"},{"source":{"id":null,"name":"Channelnewsasia.com"},"author":"CNA","title":"Youthful England ride wave of royal support","description":"England's battle-hardened youngsters have been given the royal stamp of approval ahead of Saturday's Rugby World Cup final against South Africa, Sam Underhill told reporters in Tokyo.","url":"https://www.channelnewsasia.com/news/sport/youthful-england-ride-wave-of-royal-support-12054760","urlToImage":"https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12054758/16x9/991/557/fe1fc541e136a1a93037bab7f95fc382/fL/rugby-world-cup---final---england-captain-s-run-1.jpg","publishedAt":"2019-11-01T06:45:41Z","content":"TOKYO: England's battle-hardened youngsters have been given the royal stamp of approval ahead of Saturday's Rugby World Cup final against South Africa, Sam Underhill told reporters in Tokyo.\r\n\"Prince Harry sent us a message of support, which was nice to recei… [+2452 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"STEVE DOUGLAS","title":"England, Boks meet in a RWC final not for the faint-hearted","description":"TOKYO (AP) — During one of England’s practice sessions this week, front-rower Kyle Sinckler donned a hoodie and a pair of boxing gloves and started vigorously sparring with a strength-and-conditioning coach. What better way to prepare for what could prove to …","url":"https://www.seattletimes.com/sports/england-boks-meet-in-a-rwc-final-not-for-the-faint-hearted/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-10-31T10:19:03Z","content":"TOKYO (AP) During one of England’s practice sessions this week, front-rower Kyle Sinckler donned a hoodie and a pair of boxing gloves and started vigorously sparring with a strength-and-conditioning coach.\r\nWhat better way to prepare for what could prove to b… [+5816 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"No burden, no pressure as Erasmus steers Boks to victory","description":"Rassie Erasmus regarded no detail as more important to impart on his Springboks players than context as they prepared to win the World Cup","url":"https://www.foxsports.com/rugby/story/no-burden-no-pressure-as-erasmus-steers-boks-to-victory-110219","urlToImage":"https://b.fssta.com/uploads/2019/11/34c797662fda4705a1aa9091821cd8bd.vresize.1200.630.high.51.jpg","publishedAt":"2019-11-02T14:26:36Z","content":"YOKOHAMA, Japan (AP) — Of all the intricate details that went into 618 days of planning for this moment, Rassie Erasmus regarded none as more important to impart on his Springboks than context.\r\nWhy are they at the Rugby World Cup? Who are they trying to win … [+4694 chars]"}]}